ke_model/base_steady_bound/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// epsilon = (0.164 * k**1.5)/ (0.07 L) -->
// epsilon = (0.164 * 0.00375**1.5) / (0.07 * 1) = 5.38e-4
//ep = 5.38e-4;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1; //0.00754;

boundaryField
{
    inletBoundary_patch0
    {
        type            fixedValue;
        value           uniform 0.1; //0.00754;
    }
    outletBoundary_patch2
    {
        type            zeroGradient;
    }

    fixedWalltop_patch1
    {
        type            epsilonWallFunction;    // corresponds to fixedValue
        value           uniform 0.1; //0.00754; // required
    }
    fixedWallbot_patch1
    {
        type            epsilonWallFunction;    // corresponds to fixedValue
        value           uniform 0.1; //0.00754; // required
    }

    cyc_halftop_patch2
    {
        type            cyclicAMI;
    }
    cyc_halfbot_patch2
    {
        type            cyclicAMI;
    }

    cyc_halftop_patch0
    {
        type            cyclicAMI;
    }
    cyc_halfbot_patch0
    {
        type            cyclicAMI;
    }

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
